# --- Core Tools ---
brew "stow"
brew "git"
brew "neovim"

# --- Utilities ---
brew "fastfetch"
brew "htop"

# --- Cloud & Containers ---
brew "azure-cli"
brew "dotnet"

# --- AI ---
brew "ollama"

# --- Fonts ---
cask "font-fira-code-nerd-font"
cask "font-fira-sans"

# --- Development ---
cask "jetbrains-toolbox"
cask "kitty"
cask "visual-studio-code"
cask "dotnet-sdk"
cask "docker-desktop"
cask "yaak"

# --- AI Apps ---
cask "claude"
cask "claude-code"
cask "codex"
cask "codex-app"
cask "copilot-cli"

# --- Browsers & Media ---
cask "google-chrome"
cask "iina"
cask "discord"

# --- System & Hardware ---
cask "macs-fan-control"
cask "monitorcontrol"
cask "logi-options+"
cask "focusrite-control-2"
cask "onyx"
cask "philips-hue-sync"

# --- Games ---
cask "steam"
cask "battle-net"
