# --- Core Tools ---
brew "stow"
brew "git"
brew "neovim"

# --- Modern CLI Replacements ---
brew "ripgrep"
brew "fd"
brew "bat"
brew "eza"
brew "fzf"
brew "jq"
brew "zoxide"

# --- Utilities ---
brew "fastfetch"
brew "htop"
brew "btop"
brew "dust"
brew "yq"
brew "tldr"
brew "tree"

# --- Git & Dev Tools ---
brew "gh"
brew "git-delta"
brew "lazygit"
brew "lazydocker"

# --- Runtime Management ---
brew "direnv"
brew "node"
brew "pnpm"

# --- Cloud & Containers ---
brew "azure-cli"

# --- AI ---
brew "ollama"

# --- Fonts ---
cask "font-fira-code-nerd-font"
cask "font-fira-sans"

# --- Development ---
cask "jetbrains-toolbox"
cask "kitty"
cask "visual-studio-code"
cask "dotnet-sdk"
cask "docker-desktop"
cask "yaak"

# --- AI Apps ---
cask "claude"
cask "claude-code"
cask "codex"
cask "codex-app"
cask "copilot-cli"

# --- Browsers & Media ---
cask "google-chrome"
cask "iina"
cask "discord"

# --- System & Hardware ---
cask "macs-fan-control"
cask "monitorcontrol"
cask "logi-options+"
cask "focusrite-control-2"
cask "onyx"
cask "philips-hue-sync"

# --- Games ---
cask "steam"
cask "battle-net"
